# GetReinforcementRoundingManager Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..GetReinforcementRoundingManager Method
RebarInSystem Class See Also
---
Returns an object for managing reinforcement rounding override settings.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RebarRoundingManager GetReinforcementRoundingManager()
```

Visual Basic
---
```text
Public Function GetReinforcementRoundingManager As RebarRoundingManager
```

Visual C++
---
```text
public:
RebarRoundingManager^ GetReinforcementRoundingManager()
```

# ### Return Value
The rounding manager.
# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace